_posts/2010-04-10-jquery-twitter-plugin.html
--- 
title: jQuery Twitter 'mini' plugin
layout: post
---


<h2 id="sec-1">jQuery Twitter 'mini' plugin </h2>
<div class="outline-text-2" id="text-1">


<p>
Here's a little jQuery plugin for displaying a twitter feed into
a web page.
The goal was to put my latest 'tweets' on my blog, and also learn
jQuery. 
Ended up making a 'mini' jQuery plugin that can easily be added into
any web page.
</p>

</div>

<div class="outline-3" id="outline-container-1.1">
<h3 id="sec-1.1">Demo: </h3>
<div class="outline-text-3" id="text-1.1">


<p>
For the code:
</p>


<pre class="src src-javascript">$(<span style="color: #7f007f;">function</span>() {
  $(<span style="color: #8b2252;">'#tw'</span>).click(<span style="color: #7f007f;">function</span>() {
    $(<span style="color: #8b2252;">'#tw'</span>).twitter({<span style="color: #8b2252;">'user'</span>:<span style="color: #8b2252;">'al3xandr3'</span>,<span style="color: #8b2252;">'count'</span>:2});
  });
});
</pre>





 <script src="http://ajax.googleapis.com/ajax/libs/jquery/1.4.2/jquery.min.js" type="text/javascript"></script>
 <script src="http://github.com/al3xandr3/jquery-twitter-plugin/raw/master/twitter.js" type="text/javascript"></script>
 
 <div id="tw" style="margin-bottom:1.5em;"><b>click me</b></div>
 <script type="text/javascript">
 $(function() {
   $('#tw').click(function() {
     $('#tw').twitter({'user':'al3xandr3','count':2});
   });
 });
 </script>

</div>

</div>

<div class="outline-3" id="outline-container-1.2">
<h3 id="sec-1.2">How It Works </h3>
<div class="outline-text-3" id="text-1.2">


<p>
It makes an Ajax request to twitter that returns json data of the
feed. That data is then read and injected into the selected html
element(s).
</p>
<p>
See in: 
</p>



<pre class="src src-Javascript">$.ajax({
        url: <span style="color: #8b2252;">"http://twitter.com/status/user_timeline/"</span> + settings.user + 
             <span style="color: #8b2252;">".json?count="</span>+ settings.count +<span style="color: #8b2252;">"&amp;callback=?"</span>,
        dataType: 'json',
        success: function (data) {
          $this.html(<span style="color: #8b2252;">""</span>); //clean previous html
          
          $.each(data, function (i, item) {
            
            //text
            $this.append(<span style="color: #8b2252;">"&lt;p id="</span> + item.id + <span style="color: #8b2252;">"&gt;"</span> + 
                         replaceURLWithHTMLLinks(item.text) + 
                         <span style="color: #8b2252;">"&lt;/p&gt;"</span>);

            //date
            if (typeof prettyDate(item.created_at) !== <span style="color: #8b2252;">"undefined"</span>) {       
              $(<span style="color: #8b2252;">"&lt;div&gt;&lt;a style='font-size: 80%;' href='http://twitter.com/"</span> +
                settings.user + <span style="color: #8b2252;">"/status/"</span> + item.id + <span style="color: #8b2252;">"' target='_blank'&gt;"</span> +
                prettyDate(item.created_at) + <span style="color: #8b2252;">"&lt;/a&gt;&lt;/div&gt;"</span>).appendTo(<span style="color: #8b2252;">"#"</span> + item.id);
            }
          });}
      });
</pre>



<p>
jQuery is a very nice designed lib, simple and powerfull. Some say <a href="http://importantshock.wordpress.com/2009/01/18/jquery-is-a-monad/">its just like a functional programming Monad</a>.
</p>

<p>
Full source code is available from github:
<a href="http://github.com/al3xandr3/jquery-twitter-plugin">http://github.com/al3xandr3/jquery-twitter-plugin</a>
</p></div>
</div>
